public class Main {

    public static void main(String[] args) {
        int ticketPrice = 5987; // стоимоть в рублях
        int bonusPrice = 20; // стоимость одной бонусной мили
        int bonusMiles = ticketPrice / bonusPrice; //количество получаемых бонусов

        System.out.println(bonusMiles + " бонусных миль, вы получите!");


        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}
